/* automatically generated by rust-bindgen 0.55.1 */

pub const AL_INVALID: i32 = -1;
pub const AL_NONE: u32 = 0;
pub const AL_FALSE: u32 = 0;
pub const AL_TRUE: u32 = 1;
pub const AL_SOURCE_RELATIVE: u32 = 514;
pub const AL_CONE_INNER_ANGLE: u32 = 4097;
pub const AL_CONE_OUTER_ANGLE: u32 = 4098;
pub const AL_PITCH: u32 = 4099;
pub const AL_POSITION: u32 = 4100;
pub const AL_DIRECTION: u32 = 4101;
pub const AL_VELOCITY: u32 = 4102;
pub const AL_LOOPING: u32 = 4103;
pub const AL_BUFFER: u32 = 4105;
pub const AL_GAIN: u32 = 4106;
pub const AL_MIN_GAIN: u32 = 4109;
pub const AL_MAX_GAIN: u32 = 4110;
pub const AL_ORIENTATION: u32 = 4111;
pub const AL_SOURCE_STATE: u32 = 4112;
pub const AL_INITIAL: u32 = 4113;
pub const AL_PLAYING: u32 = 4114;
pub const AL_PAUSED: u32 = 4115;
pub const AL_STOPPED: u32 = 4116;
pub const AL_BUFFERS_QUEUED: u32 = 4117;
pub const AL_BUFFERS_PROCESSED: u32 = 4118;
pub const AL_REFERENCE_DISTANCE: u32 = 4128;
pub const AL_ROLLOFF_FACTOR: u32 = 4129;
pub const AL_CONE_OUTER_GAIN: u32 = 4130;
pub const AL_MAX_DISTANCE: u32 = 4131;
pub const AL_SEC_OFFSET: u32 = 4132;
pub const AL_SAMPLE_OFFSET: u32 = 4133;
pub const AL_BYTE_OFFSET: u32 = 4134;
pub const AL_SOURCE_TYPE: u32 = 4135;
pub const AL_STATIC: u32 = 4136;
pub const AL_STREAMING: u32 = 4137;
pub const AL_UNDETERMINED: u32 = 4144;
pub const AL_FORMAT_MONO8: u32 = 4352;
pub const AL_FORMAT_MONO16: u32 = 4353;
pub const AL_FORMAT_STEREO8: u32 = 4354;
pub const AL_FORMAT_STEREO16: u32 = 4355;

    ::std::option::Option<unsafe extern "C" fn(arg1: ALuint, arg2: ALenum, arg3: ALint64SOFT)>;
pub type LPALSOURCE3I64SOFT = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ALuint,
        arg2: ALenum,
        arg3: ALint64SOFT,
        arg4: ALint64SOFT,
        arg5: ALint64SOFT,
    ),
>;
pub type LPALSOURCEI64VSOFT = ::std::option::Option<
    unsafe extern "C" fn(arg1: ALuint, arg2: ALenum, arg3: *const ALint64SOFT),
>;
pub type LPALGETSOURCEI64SOFT =
    ::std::option::Option<unsafe extern "C" fn(arg1: ALuint, arg2: ALenum, arg3: *mut ALint64SOFT)>;
pub type LPALGETSOURCE3I64SOFT = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ALuint,
        arg2: ALenum,
        arg3: *mut ALint64SOFT,
        arg4: *mut ALint64SOFT,
        arg5: *mut ALint64SOFT,
    ),
>;
pub type LPALGETSOURCEI64VSOFT =
    ::std::option::Option<unsafe extern "C" fn(arg1: ALuint, arg2: ALenum, arg3: *mut ALint64SOFT)>;
pub type LPALDEFERUPDATESSOFT = ::std::option::Option<unsafe extern "C" fn() -> ALvoid>;
pub type LPALPROCESSUPDATESSOFT = ::std::option::Option<unsafe extern "C" fn() -> ALvoid>;
pub type LPALCDEVICEPAUSESOFT = ::std::option::Option<unsafe extern "C" fn(device: *mut ALCdevice)>;
pub type LPALCDEVICERESUMESOFT =
    ::std::option::Option<unsafe extern "C" fn(device: *mut ALCdevice)>;
pub type LPALCGETSTRINGISOFT = ::std::option::Option<
    unsafe extern "C" fn(
        device: *mut ALCdevice,
        paramName: ALCenum,
        index: ALCsizei,
    ) -> *const ALCchar,
>;
pub type LPALCRESETDEVICESOFT = ::std::option::Option<
    unsafe extern "C" fn(device: *mut ALCdevice, attribs: *const ALCint) -> ALCboolean,
>;
pub type LPALGETSTRINGISOFT =
    ::std::option::Option<unsafe extern "C" fn(pname: ALenum, index: ALsizei) -> *const ALchar>;
pub type ALCint64SOFT = i64;
pub type ALCuint64SOFT = u64;
pub type LPALCGETINTEGER64VSOFT = ::std::option::Option<
    unsafe extern "C" fn(
        device: *mut ALCdevice,
        pname: ALCenum,
        size: ALsizei,
        values: *mut ALCint64SOFT,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EFXEAXREVERBPROPERTIES {
    pub flDensity: f32,
    pub flDiffusion: f32,
    pub flGain: f32,
    pub flGainHF: f32,
    pub flGainLF: f32,
    pub flDecayTime: f32,
    pub flDecayHFRatio: f32,
    pub flDecayLFRatio: f32,
    pub flReflectionsGain: f32,
    pub flReflectionsDelay: f32,
    pub flReflectionsPan: [f32; 3usize],
    pub flLateReverbGain: f32,
    pub flLateReverbDelay: f32,
    pub flLateReverbPan: [f32; 3usize],
    pub flEchoTime: f32,
    pub flEchoDepth: f32,
    pub flModulationTime: f32,
    pub flModulationDepth: f32,
    pub flAirAbsorptionGainHF: f32,
    pub flHFReference: f32,
    pub flLFReference: f32,
    pub flRoomRolloffFactor: f32,
    pub iDecayHFLimit: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_EFXEAXREVERBPROPERTIES() {
    assert_eq!(
        ::std::mem::size_of::<EFXEAXREVERBPROPERTIES>(),
        108usize,
        concat!("Size of: ", stringify!(EFXEAXREVERBPROPERTIES))
    );
    assert_eq!(
        ::std::mem::align_of::<EFXEAXREVERBPROPERTIES>(),
        4usize,
        concat!("Alignment of ", stringify!(EFXEAXREVERBPROPERTIES))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flDensity as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flDensity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flDiffusion as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flDiffusion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flGain as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flGain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flGainHF as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flGainHF)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flGainLF as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flGainLF)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flDecayTime as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flDecayTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flDecayHFRatio as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flDecayHFRatio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flDecayLFRatio as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flDecayLFRatio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flReflectionsGain as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flReflectionsGain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flReflectionsDelay as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flReflectionsDelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flReflectionsPan as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flReflectionsPan)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flLateReverbGain as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flLateReverbGain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flLateReverbDelay as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flLateReverbDelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flLateReverbPan as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flLateReverbPan)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flEchoTime as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flEchoTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flEchoDepth as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flEchoDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flModulationTime as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flModulationTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flModulationDepth as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flModulationDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flAirAbsorptionGainHF as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flAirAbsorptionGainHF)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flHFReference as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flHFReference)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flLFReference as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flLFReference)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).flRoomRolloffFactor as *const _
                as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(flRoomRolloffFactor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<EFXEAXREVERBPROPERTIES>())).iDecayHFLimit as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(EFXEAXREVERBPROPERTIES),
            "::",
            stringify!(iDecayHFLimit)
        )
    );
}

/* automatically generated by build.rs */

impl EFXEAXREVERBPROPERTIES {
    #[doc = "EFX_REVERB_PRESET_GENERIC"]
    pub fn generic() -> Self {
        Self {
            flDensity: 1.0000,
            flDiffusion: 1.0000,
            flGain: 0.3162,
            flGainHF: 0.8913,
            flGainLF: 1.0000,
            flDecayTime: 1.4900,
            flDecayHFRatio: 0.8300,
            flDecayLFRatio: 1.0000,
            flReflectionsGain: 0.0500,
            flReflectionsDelay: 0.0070,
            flReflectionsPan: [0.0000, 0.0000, 0.0000],
            flLateReverbGain: 1.2589,
            flLateReverbDelay: 0.0110,
            flLateReverbPan: [0.0000, 0.0000, 0.0000],
            flEchoTime: 0.2500,
            flEchoDepth: 0.0000,
            flModulationTime: 0.2500,
            flModulationDepth: 0.0000,
